<template>
    <ClientOnly>
      <AnimatedTestimonials :NewsItems="NewsItems" :autoplay="false" :duration="5000" />
    </ClientOnly>
  </template>
  
  <script lang="ts" setup>
import AnimatedTestimonials from "./inspira_ui/AnimatedNewsItems.vue";


  const NewsItems= [
//(@#
{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30729423'], 'Title': '13家券商一季报出炉：超七成业绩预喜，财通、湘财、第一创业下滑', 'MainText': '4月25日晚，13家上市券商披露2025年一季报，其中10家券商营收和净利润实现同比增长，包括东吴证券、兴业证券等。财通证券、第一创业、湘财股份营收和净利润下滑。头部券商如国泰海通、中信证券、华泰证券等预增预告净利润同比增长超30%。券商研报看好证券板块投资机会，估值、政策、回购等因素推动券商板块估值修复。', 'ImageUrl': 'eafd87b4bd434e1eb2a53f842a07acc5.png'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780772'], 'Title': '为什么四大家鱼是青草鲢鳙，而没有鲫鱼和鲤鱼？', 'MainText': '鲫鱼和鲤鱼能在封闭鱼塘自我繁殖，而四大家鱼（青鱼、草鱼、鲢鱼、鳙鱼）不能。古代鲤鱼养殖早于四大家鱼，鲤鱼在唐朝前已形成养殖产业，而四大家鱼到宋代才形成规模。四大家鱼育苗问题一直困扰养殖业，直到建国后科学家才解决。鲤鱼因能自我繁殖，成为唐朝前的主要养殖鱼类。四大家鱼饲料比低，尤其是鲢鱼和鳙鱼，可低于1:1，适合大规模养殖。鲫鱼体形小，饲料比高，且野外易捕，无需人工养殖。', 'ImageUrl': '881107e0b3e9e1b5afb6f7903bf8f3ed.jpg'},{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7497922339380822564/'], 'Title': '印巴两军再度交火，巴铁希望中方出面调查，为巴基斯坦主持公道', 'MainText': '22日，印控克什米尔地区发生袭击，造成26人死、数人伤。印方指责巴方，印度总理莫迪回国宣布对巴强硬措施，包括暂停‘印度河水协定’、关闭陆地口岸、取消签证。24日，两军在克什米尔边境交火。巴基斯坦向中国发出两大请求：一是希望中国调查事件，为巴主持公道；二是希望中国增加100亿元人民币的货币互换额度，以应对潜在冲突导致的经济压力。中方对巴反恐支持坚定，但直接介入调查存在困难。', 'ImageUrl': '0cccab1508396d5249fc61a07dd727b1.jpg'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780783'], 'Title': '石头缝里都能长树，为什么草原不长树？', 'MainText': '草原也长树，但木本植物存活率低。草原年降水量250-750毫米，利于草本植物生长，不利于树木。草本植物根系密集，能快速吸收水分，而树木幼苗根系需穿透钙积层，存活率低。草原火灾频发，摧毁树木幼苗，但利于草本植物。岩石裂隙中树木生长条件较好，能提供天然庇护。此外，胡杨和风滚草等植物通过特殊方式在草原生存。气候变化和CO2浓度升高可能改变植物竞争格局。', 'ImageUrl': 'd624229422c40ccbf4dd22c4d869fd11.jpg'},{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30729514'], 'Title': '影子调查｜23岁男子驾照拟注销背后的“被精神病”疑云', 'MainText': '2024年4月10日，23岁的云南会泽县小伙宋赫收到昆明市车管所通知，因被诊断为精神分裂症，其驾驶证将被注销。2016年9月2日，会泽县人民医院医生王某在未取得精神卫生执业资格的情况下，诊断宋赫为精神分裂症并纳入管理。宋赫及其父亲否认曾进行精神诊断。4月14日，曲靖市第三人民医院诊断宋赫无精神疾病。4月24日，会泽县卫健局称将按程序移除宋赫的重性精神疾病管理，并恢复其驾照。', 'ImageUrl': '4619eebbb54ff21050c0df872adcedb1.png'},{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7497763975376192015'], 'Title': '各领域开局良好、外资企业一投再投……多侧面透视中国经济强劲动力', 'MainText': '一季度，我国春播全面展开，东北地区春播、长江流域冬油菜即将收获。黑龙江垦区和内蒙古自治区使用现代农机具提升播种进度。黄淮海麦区进入小麦齐穗扬花期，河南滑县开展“一喷三防”作业。一季度，我国交通行业实现良好开局，人员流动量173.9亿人次，同比增长4%。货运量130.6亿吨，同比增长4.9%。港口货物吞吐量42.2亿吨，同比增长3.2%。一季度，乡村消费品零售额16614亿元，同比增长4.9%。山东以科技赋能推动文旅产业高质量发展，一季度重点景区接待游客548万人次，同比增长31.21%。江苏太仓优化营商环境，吸引外资企业持续增资扩产，一季度新签约项目32个，总投资110.8亿元。', 'ImageUrl': 'dbf97f6c41d7a857173d1dee8059c9d1.jpg'}
//(@#
  ];

  </script>