<template >
    <ClientOnly>
     <div id="news">
      <AnimatedTestimonials :NewsItems="NewsItems" :autoplay="false" :duration="5000"  id="NewsCard"/>
     </div>
    </ClientOnly>
  </template>
  
  <script lang="ts" setup>
import AnimatedTestimonials from "./inspira_ui/AnimatedNewsItems.vue";


  const NewsItems= [
//(@#
{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7498583653325488674/'], 'Title': '网友爆料董袭莹本科相当于国内三本，不符合协和4+4要求', 'MainText': '董袭莹被介绍为北京协和医学院2023届毕业生，本科毕业于哥伦比亚大学，主修经济学。网友质疑其实际毕业院校为巴纳德学院，与哥大仅一墙之隔，但独立运营。巴纳德学院被类比为国内独立学院，其入学途径被指存在捷径，质疑董袭莹是否符合协和4+4医学博士项目要求。', 'ImageUrl': '54556c9263afb88854bf222f15daf853.jpg'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780803'], 'Title': '动物的眼睛所看到的，和人类的眼睛所看到的，是一样的吗?', 'MainText': '动物和人类的眼睛看到的有很大的不同。人类比猫和狗拥有更多的视锥细胞，负责颜色识别，而猫和狗只能看到部分颜色。猫看不到红色，狗只能看到蓝色和黄色，且视力不如人类。猫和狗有更多视杆细胞，适合夜间视力。鸟类能看到紫外光，视力非常敏锐，但牺牲了立体知觉。蛇类能感知红外线，通过颊窝捕食。蜜蜂能看到紫外线，但看不到红色。', 'ImageUrl': '28bf1015d0430b06c85ad1acbe9e0bf9.jpg'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780792'], 'Title': '为什么赵云一定要加「常山」两个字？', 'MainText': '武夫们起自称讲究颇多，主要目的是吓阻敌人，彰显实力和背景。赵云自称“常山赵子龙”而不是具体地名，以彰显神秘和威严，避免敌人轻易查到底细。自称要响亮、易记，避免冗长和烂大街的称谓，且不能与已有知名自称冲突。赵云加‘常山’二字，符合这些原则，显得有实力、不好惹。', 'ImageUrl': '9d144d57c8e5c5aeeeb08cef08ffcd71.jpg'},{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30741996'], 'Title': '西班牙葡萄牙突发全国大停电，欧洲近年来最严重停电事故何以酿成', 'MainText': '4月28日，西班牙、葡萄牙及法国部分地区突发大规模停电，数百万人受影响。交通和通信瘫痪，民众抢购食品和饮用水，马德里网球公开赛叫停。西班牙首相桑切斯称50%地区已恢复供电，但恢复全国供电需更长时间。葡萄牙总理蒙特内格罗称恢复电力需数小时，优先保障关键基础设施。停电由电网强烈振荡引发，电网负荷骤降超1000万千瓦。此次事故暴露了欧洲电网的脆弱性，是近年来最严重停电事故之一。', 'ImageUrl': '0085502c292c37bddfe3871d62223d68.jpg'},{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30736470'], 'Title': '从全新QQ到飞行汽车：奇瑞展台藏着出行需求的100种解法', 'MainText': '上海车展上，奇瑞展台展示了从全新QQ到飞行汽车等多种出行解决方案。全新QQ通过4250mm车长和2750mm轴距重新定义微型车空间，提供个性化定制。风云A9盲订突破5万台，运动性能版和行政四座版满足不同需求。瑞虎9L以2950mm轴距和5米车长提升家庭出行标准，AI数智底盘提升驾控体验。捷途纵横G900结合800V高压推进器和IPX8级防水设计，实现水陆两栖行驶。奇瑞在技术上持续突破，热效率达48%的鲲鹏天擎发动机展示其技术实力。奇瑞2024年出口114.5万辆，与韩国KGM合作开发新一代SUV，从产品出口商进化为技术输出者。', 'ImageUrl': 'c926c15308dd88687e809f50f24a07d9.jpg'},{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7498571133571154483/'], 'Title': '第一批追高黄金的年轻人，已经亏麻了，大学生一天亏一个月生活费', 'MainText': '4月初至4月22日，黄金价格从2982美元/盎司涨至3500美元/盎司，国内金价每克涨约130元。许多年轻人高位入场，如Cici在4月22日以833元/克买入40万元黄金，随后金价跌至773元/克，她亏了2万元。章明在4月22日以833元/克买入20万元黄金，随后割肉亏损9300元。彩虹在4月23日一天亏损1300元，超过一个月生活费。这些年轻人多为首次投资，缺乏经验，被市场情绪左右，最终成为第一批被收割的韭菜。', 'ImageUrl': 'c1a722c627a88d29136a77a309efe485.jpg'}
//(@#
  ];

  </script>