<template >
    <ClientOnly>
     <div id="news">
      <AnimatedTestimonials :NewsItems="NewsItems" :autoplay="false" :duration="5000"  id="NewsCard"/>
     </div>
    </ClientOnly>
  </template>
  
  <script lang="ts" setup>
import AnimatedTestimonials from "./inspira_ui/AnimatedNewsItems.vue";


  const NewsItems= [
//(@#
{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7501464692846543410/'], 'Title': '印度向美介绍对巴行动 特朗普称“真可耻”', 'MainText': '7日凌晨，印度驻美大使馆声明称，印度武装部队的“辛杜尔行动”后，国家安全顾问多瓦尔与美国国务卿鲁比奥交谈，介绍行动细节。行动精准、避免升级，只攻击已知恐怖分子营地，未袭击巴基斯坦平民、经济或军事目标。此前，特朗普称印度对巴军事行动“真可耻”，表示希望尽快结束。', 'ImageUrl': 'd94290a1672696f11929c8a264124a75.jpg'},{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30773570'], 'Title': '为了撕番而脱粉，内娱粉丝为何如此在乎番位', 'MainText': '5月6日，国产剧《翘楚》官宣陈都灵、周翊然领衔主演，排名不分先后。双方粉丝因番位争执，甚至将‘脱粉’送上热搜第一。陈都灵和周翊然分别发文回应，呼吁理性看待。近年来，国产剧撕番频发，古偶剧尤甚。番位被视为流量化和粉丝经济的产物，影响演员后续作品和商业价值。实际很多演员从配角成长而来，粉丝应理性支持，共同打造更好的制作环境。', 'ImageUrl': 'a3c280478cd099223fafdb716c7ffdd0.jpg'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9781003'], 'Title': '徐女士的一身反骨：从育儿到支持女儿的闪婚', 'MainText': '徐女士，一位古稀之年的母亲，用一生的坚持和反骨影响了女儿。小时候，她每天下班后为女儿读书，用书香和爱陪伴女儿成长。尽管周围亲戚的质疑，她仍坚持买育儿书，每天讲故事、读古诗，最终女儿三岁多开口说话，口齿清晰。2012年，女儿决定和认识50天的网恋男友闪婚，徐女士非常支持，坚信女儿的选择。她教会女儿，无论何时何地，都要有勇气和信任。', 'ImageUrl': '69f6015e388ba52121031c2aa2c75609.jpg'},{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7501469712891576859/'], 'Title': '巴基斯坦宣布进入紧急状态，全国教育机构停课，外交部谴责印度侵略行径', 'MainText': '5月7日，印度袭击巴基斯坦后，巴基斯坦全国主要城市宣布进入紧急状态，所有学校和教育机构停课。巴基斯坦外交部发表声明，强烈谴责印度空军未经挑衅对平民发动袭击，侵犯巴基斯坦主权，导致平民伤亡，威胁商业空中交通。巴方称印度行为违反《联合国宪章》和国际法，保留根据《联合国宪章》第五十一条和国际法做出回应的权利。', 'ImageUrl': 'fb2bfbf70b4868896287bed6d71a6c07.jpg'},{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30772044'], 'Title': '五一档观众最满意《水饺皇后》', 'MainText': '5月6日，2025年五一档《中国电影观众满意度调查》发布。《水饺皇后》排名第一，获得观众“满意”评价，这是近三年非动作类影片首次夺冠。《大风杀》和《猎金·游戏》分列第二、三位。今年五一档满意度得分83.6分，同比增长0.4分，为近年来同期最高。调查覆盖全国一二三四线城市，五部影片类型多样，包括传记、喜剧、悬疑、犯罪、公路文艺等，提供更多观影选择。普通观众和专业观众评价趋同，《水饺皇后》在主要演员表演、不枯燥、正能量等六项指标得分最高。档期传播度增长显著，优质影片如《水饺皇后》《大风杀》票房呈上行趋势。但制片单位和宣发方在营销模式上创新不足，高满意度影片未形成显著头部效应。', 'ImageUrl': '778f87484214e672efb0f383588b61f0.png'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780990'], 'Title': '没有西医以前，西方人是怎么看病的？', 'MainText': '16世纪，医生用木工锯为坏疽病人截肢，不打麻药。18世纪，磁疗大师梅斯梅尔用磁力治疗多种疾病，认为磁力能治通病。放血疗法从16世纪持续到19世纪初，用刀、剪子、水蛭等工具放血。18世纪，俄国医生发明电浴疗法，用于治疗各种疾病。19世纪初，汞被用于治疗梅毒，汞蒸气浴让患者浑身不适。18世纪，鸦片被用于制作温斯洛太太平静糖浆，治疗失眠。18世纪，士的宁制成提神醒脑液，用于抗瞌睡。18世纪，烟草用于灌肠，刺激呼吸。19世纪，放血刀样式多样，放血害死不少人。19世纪，上层女性流行骨盆冲洗法，用冷水刺激身体。18世纪，一氧化碳用于治疗唠叨，让妻子安静。', 'ImageUrl': '0d6e6afe523f1faa108bbf32bc3977b7.jpg'}
//(@#
  ];

  </script>