<template >
    <ClientOnly>
     <div id="news">
      <AnimatedTestimonials :NewsItems="NewsItems" :autoplay="false" :duration="5000"  id="NewsCard"/>
     </div>
    </ClientOnly>
  </template>
  
  <script lang="ts" setup>
import AnimatedTestimonials from "./inspira_ui/AnimatedNewsItems.vue";


  const NewsItems= [
//(@#
{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780822'], 'Title': '从生物学的角度，人首蛇身这种形态能生存吗？', 'MainText': '从生物学角度看，未经蓄意干预的进化难以产生高度类人的头或上半身和高度类蛇的身体或下半身的动物。若考虑人工改造，这种动物在实验室中养活并不困难，但释放到野外可能引发生态灾难。许多地方有类似传说，但这不能证明此类生物曾经存在。蛇捕食其他生物时，可能看起来像是有其他生物形象的部分。古代传说中，女娲等神灵形象常被描绘成有蛇身或四肢。', 'ImageUrl': '73a187e75c0b458e7281dfa6b42f5d68.jpg'},{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7499053871793209894'], 'Title': '量足价稳、活动多元…… “五一”假期消费市场热度持续攀升', 'MainText': '五一假期将至，消费市场热度攀升。全国多地丰富市场供给，优化消费服务。北京生鲜超市加大轻食类食材供应，江西南昌推出绿色农产品直供专区，确保节日期间市场供应稳定。此外，多地推出“以旧换新”活动，如江苏盐城发放200万元汽车消费券，上海扩大汽车置换补贴范围，宁夏和贵州遵义也推出多项补贴活动，带动消费热潮。', 'ImageUrl': '0c3aefd53fb6d7190fb9b375daf10004.jpg'},{'SourceTextLink': ['来源于[澎湃新闻]点击查看原文', 'https://www.thepaper.cn/newsDetail_forward_30749178'], 'Title': '民营经济促进法出台，自2025年5月20日起施行', 'MainText': '4月30日，十四届全国人大常委会第十五次会议通过民营经济促进法，自2025年5月20日起施行。该法共9章78条，涵盖公平竞争、投资融资促进、科技创新、规范经营、服务保障、权益保护等内容。作为我国首部专门关于民营经济发展的基础性法律，民营经济促进法将优化民营经济发展环境，确保各类经济组织公平竞争，促进民营经济健康发展和民营经济人士健康成长，构建高水平社会主义市场经济体制，发挥民营经济在国民经济和社会发展中的重要作用。', 'ImageUrl': '357fe93f376659706482a0a8d5b8cdbf.jpg'},{'SourceTextLink': ['来源于[知乎日报]点击查看原文', 'https://daily.zhihu.com/story/9780820'], 'Title': '石头甚至不能降解，为什么不如塑料危害性大？', 'MainText': '石头主要由天然矿物构成，化学性质稳定，风化后颗粒不会释放有毒物质，且能与土壤共存。塑料由高分子聚合物构成，分解为微塑料后会释放塑化剂、双酚A等有毒物质，污染环境。塑料密度低，易扩散，可通过食物链累积，干扰生物内分泌系统。石头密度高，不易迁移，不会在生物体内累积。生物进化过程中已适应石头，但塑料出现时间短，生物难以适应。部分微生物可降解塑料，但速度慢。综上，塑料的危害大于石头。', 'ImageUrl': 'ad8ae77a8bb96d74f698df46ca86af68.jpg'},{'SourceTextLink': ['来源于[头条新闻]点击查看原文', 'https://www.toutiao.com/article/7499014211637412367/'], 'Title': '网传印巴若开战，中国将依据中巴防御协定出兵？真相并非如此', 'MainText': '随着印巴局势升级，双方在前线集结重兵。巴方称印度可能在36小时内动武。有谣言称，若印巴开战，中国将依据《中巴防御协定》出兵。但实际上，中巴之间并未签署此类协定。中巴关系始于1955年万隆会议，1963年签署边界协定。1967年印巴战争期间，中国提供援助但未出兵。2005年签署《中巴睦邻友好合作条约》，不涉及‘自动互防’。中国外交原则为不结盟、不对抗，不针对第三方。印巴若爆发全面战争，中国将确保中巴经济走廊安全。外长王毅表示，支持巴方反恐行动，将通过上合、金砖等平台推动多边对话。', 'ImageUrl': '555efed0ca7cff9de9f485f2848e6965.jpg'}
//(@#
  ];

  </script>